<a href="https://colab.research.google.com/github/mishraoct786/MachineLearning-/blob/main/heroku_model_deployment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import sklearn

In [4]:
df =pd.read_csv('hiring.csv')

In [5]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [6]:
df.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [7]:
df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean(),inplace=True)

In [8]:
df['experience'].fillna(0,inplace=True)

In [9]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0               8.000000                           9      50000
1          0               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [10]:
def stringToNum(word):
  dict={'zero':0,'one':1,'five':5,'two' : 2,
        'seven':7, 'three': 3 , 'ten':10,'eleven':11,0:0}
  return dict[word]

In [11]:
df['experience']=df['experience'].apply(lambda  x: stringToNum(x))

In [12]:
x=df.iloc[:,:3]
y=df.iloc[:,-1]

In [13]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.1,random_state=5)

In [16]:
from sklearn.linear_model import  LinearRegression
mymodel=LinearRegression()
mymodel.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [17]:
y_pred=mymodel.predict(x_test)

In [19]:
y=mymodel.predict([[5,8,7]])

In [20]:
y

array([61938.84379748])

In [22]:
import  pickle
pickle.dump(mymodel,open("model.pkl","wb"))